УчетВУправляющихДляГит1/src/Documents/КВП_УправлениеУслугами/КВП_УправлениеУслугами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_УправлениеУслугами</name>
  <registerRecords>InformationRegister.КВП_НазначенныеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.КВП_ВидыОперацийУправленияУслугами</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>Услуга</comment>
    <type>
      <types>CatalogRef.КВП_Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Объекты</name>
    <attributes>
      <name>Объект</name>
      <comment>Объект</comment>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
        <types>CatalogRef.УПЖКХ_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_УправлениеУслугами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.Услуга,
	|	Реквизиты.ДатаНач,
	|	Реквизиты.ДатаКон,
	|	Реквизиты.Комментарий,
	|	Реквизиты.Ответственный,
	|	Реквизиты.КраткийСоставДокумента
	|ИЗ
	|	Документ.КВП_УправлениеУслугами КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Организация,ВидОперации,
								|Услуга,ДатаНач,ДатаКон,Комментарий,
								|Ответственный,КраткийСоставДокумента");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	// Подготовим таблицу управления услугами.
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Объекты.Объект,
	|	Объекты.ДатаНачала,
	|	Объекты.ДатаОкончания
	|ИЗ
	|	Документ.КВП_УправлениеУслугами.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Ссылка";
	
	ТаблицаУправленияУслугами = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПроведения.Вставить("ТаблицаУправленияУслугами", ТаблицаУправленияУслугами);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти 

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
